# 根据提供的学生成绩单，完成如下需求：
#
# 1.计算每个学生的总分、各科平均分，然后一并输出出来。
# 2.统计各科成绩的最低分、最高分、平均分，并输出。
# 3.查找成绩优秀（平均分大于90）的学生，并输出。
# 学号	姓名	语文	数学	英语
# S001	王林	85	92	78
# S002	李慕婉	92	88	95
# S003	十三	78	85	82
# S004	曾牛	88	79	91
# S005	周铁	95	96	89
# S006	王卓	76	82	77
# S007	红蝶	89	91	94
# S008	徐立国	75	69	82
# S009	许木	86	89	98
# S010	通天	66	59	72
student = (
    ("S001", "王林", 85, 92, 78),
    ("S002", "李慕婉", 92, 88, 95),
    ("S003", "十三", 78, 85, 82),
    ("S004", "曾牛", 88, 79, 91),
    ("S005", "周铁", 95, 96, 89),
    ("S006", "王卓", 76, 82, 77),
    ("S007", "红蝶", 89, 91, 94),
    ("S008", "徐立国", 75, 69, 82),
    ("S009", "许木", 86, 89, 98),
    ("S010", "通天", 66, 59, 72)
)
print("学号\t\t姓名\t\t语文\t\t数学\t\t英语\t\t总分\t\t平均分")
for i in student:
    total = i[2] + i[3] + i[4]
    avg = total / 3
    print(f"{i[0]} \t {i[1]} \t {i[2]} \t {i[3]} \t {i[4]} \t {total} \t {avg:.1f}")
chinese=[i[2] for i in student]
math=[i[3] for i in student]
eglish=[i[4] for i in student]
chinese.sort()
math.sort()
eglish.sort()
print(f"语文的最低分数是：{chinese[0]},语文的最高分数是：{chinese[9]}，语文的平均分数是：{sum(chinese)/len(chinese)}")
print(f"数学低分数是：{math[0]},数学的最高分数是：{math[9]}，数学的平均分数是：{sum(math)/len(math)}")
print(f"英语的最低分数是：{eglish[0]},英语的最高分数是：{eglish[9]}，英语的平均分数是：{sum(eglish)/len(eglish)}")

